gb88/Adafruit_nRF52_Arduino_for_secure_bootloader/boards.txt
menu.softdevice=SoftDevice
menu.debug=Debug


# -----------------------------------
# U-Blox BMD 350 nRF52832
# -----------------------------------
ublox350.name=U-Blox BMD 350 nRF52832

# VID/PID for Bootloader, Arduino & CircuitPython

# Upload
ublox350.bootloader.tool=bootburn
ublox350.upload.tool=nrfutil
ublox350.upload.protocol=nrfutil
ublox350.upload.use_1200bps_touch=false
ublox350.upload.wait_for_upload_port=false
ublox350.upload.native_usb=false
ublox350.upload.maximum_size=290816
ublox350.upload.maximum_data_size=52224

# Build
ublox350.build.mcu=cortex-m4
ublox350.build.f_cpu=64000000
ublox350.build.board=NRF52832_UBLOX_350
ublox350.build.core=nRF5
ublox350.build.variant=bmd_350
ublox350.build.usb_manufacturer="UBlox"
ublox350.build.usb_product="U-Blox BMD 350"
ublox350.build.extra_flags=-DNRF52832_XXAA -DNRF52
ublox350.build.ldscript=nrf52832_s132_v6.ld

# SoftDevice Menu
ublox350.menu.softdevice.s132v6=S132 6.1.1
ublox350.menu.softdevice.s132v6.build.sd_name=s132
ublox350.menu.softdevice.s132v6.build.sd_version=6.1.1
ublox350.menu.softdevice.s132v6.build.sd_fwid=0x00B7

# Debug Menu
ublox350.menu.debug.l0=Level 0 (Release)
ublox350.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
ublox350.menu.debug.l1=Level 1 (Error Message)
ublox350.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
ublox350.menu.debug.l2=Level 2 (Full Debug)
ublox350.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
ublox350.menu.debug.l3=Level 3 (Segger SystemView)
ublox350.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
ublox350.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# -----------------------------------
# Adafruit Feather nRF52832
# -----------------------------------
feather52832.name=Adafruit Feather nRF52832

# VID/PID for Bootloader, Arduino & CircuitPython

# Upload
feather52832.bootloader.tool=bootburn
feather52832.upload.tool=nrfutil
feather52832.upload.protocol=nrfutil
feather52832.upload.use_1200bps_touch=false
feather52832.upload.wait_for_upload_port=false
feather52832.upload.native_usb=false
feather52832.upload.maximum_size=290816
feather52832.upload.maximum_data_size=52224

# Build
feather52832.build.mcu=cortex-m4
feather52832.build.f_cpu=64000000
feather52832.build.board=NRF52832_FEATHER
feather52832.build.core=nRF5
feather52832.build.variant=feather_nrf52832
feather52832.build.usb_manufacturer="Adafruit"
feather52832.build.usb_product="Feather nRF52832"
feather52832.build.extra_flags=-DNRF52832_XXAA -DNRF52
feather52832.build.ldscript=nrf52832_s132_v6.ld

# SoftDevice Menu
feather52832.menu.softdevice.s132v6=S132 6.1.1
feather52832.menu.softdevice.s132v6.build.sd_name=s132
feather52832.menu.softdevice.s132v6.build.sd_version=6.1.1
feather52832.menu.softdevice.s132v6.build.sd_fwid=0x00B7

# Debug Menu
feather52832.menu.debug.l0=Level 0 (Release)
feather52832.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
feather52832.menu.debug.l1=Level 1 (Error Message)
feather52832.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
feather52832.menu.debug.l2=Level 2 (Full Debug)
feather52832.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
feather52832.menu.debug.l3=Level 3 (Segger SystemView)
feather52832.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
feather52832.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# -----------------------------------
# Adafruit Feather nRF52840 Express
# -----------------------------------
feather52840.name=Adafruit Feather nRF52840 Express

# VID/PID for Bootloader, Arduino & CircuitPython
feather52840.vid.0=0x239A
feather52840.pid.0=0x8029
feather52840.vid.1=0x239A
feather52840.pid.1=0x0029
feather52840.vid.2=0x239A
feather52840.pid.2=0x002A
feather52840.vid.3=0x239A
feather52840.pid.3=0x802A

# Upload
feather52840.bootloader.tool=bootburn
feather52840.upload.tool=nrfutil
feather52840.upload.protocol=nrfutil
feather52840.upload.use_1200bps_touch=true
feather52840.upload.wait_for_upload_port=true
feather52840.upload.maximum_size=815104
feather52840.upload.maximum_data_size=237568

# Build
feather52840.build.mcu=cortex-m4
feather52840.build.f_cpu=64000000
feather52840.build.board=NRF52840_FEATHER
feather52840.build.core=nRF5
feather52840.build.variant=feather_nrf52840_express
feather52840.build.usb_manufacturer="Adafruit"
feather52840.build.usb_product="Feather nRF52840 Express"
feather52840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
feather52840.build.ldscript=nrf52840_s140_v6.ld
feather52840.build.vid=0x239A
feather52840.build.pid=0x8029

# SoftDevice Menu
feather52840.menu.softdevice.s140v6=S140 6.1.1
feather52840.menu.softdevice.s140v6.build.sd_name=s140
feather52840.menu.softdevice.s140v6.build.sd_version=6.1.1
feather52840.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
feather52840.menu.debug.l0=Level 0 (Release)
feather52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
feather52840.menu.debug.l1=Level 1 (Error Message)
feather52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
feather52840.menu.debug.l2=Level 2 (Full Debug)
feather52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
feather52840.menu.debug.l3=Level 3 (Segger SystemView)
feather52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
feather52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1


# -----------------------------------
# Custom EcgBoard nRF52840 V2.4
# -----------------------------------
custom24.name=EcgBoard nRF52840 V2.4

# VID/PID for Bootloader, Arduino & CircuitPython
custom24.vid.0=0x239A
custom24.pid.0=0x8029
custom24.vid.1=0x239A
custom24.pid.1=0x0029
custom24.vid.2=0x239A
custom24.pid.2=0x002A
custom24.vid.3=0x239A
custom24.pid.3=0x802A

# Upload
custom24.bootloader.tool=bootburn
custom24.upload.tool=nrfutil
custom24.upload.protocol=nrfutil
custom24.upload.use_1200bps_touch=true
custom24.upload.wait_for_upload_port=true
custom24.upload.maximum_size=815104
custom24.upload.maximum_data_size=237568

# Build
custom24.build.mcu=cortex-m4
custom24.build.f_cpu=64000000
custom24.build.board=ECG_BOARD_24
custom24.build.core=nRF5
custom24.build.variant=ecgboard_v2_4
custom24.build.usb_manufacturer="Custom"
custom24.build.usb_product="EcgBoard nRF52840 v2.4"
custom24.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
custom24.build.ldscript=nrf52840_s140_v6.ld
custom24.build.vid=0x239A
custom24.build.pid=0x8029

